---
kind: type
id: T:Autodesk.Revit.DB.DisplayStyle
source: html/c12fdb48-6127-0e0e-0fdc-9f370beb74ca.htm
---
# Autodesk.Revit.DB.DisplayStyle

Display type of the view.

## Syntax (C#)
```csharp
public enum DisplayStyle
```